[{
  "_id": {
    "$oid": "64bb897b64502d2315ff4742"
  },
  "title": "How do you make friends once in school?",
  "username": "soraruru",
  "votes": 29,
  "date": "2015-10-23T01:07:53-08:00",
  "deleted": false,
  "clickvote": false,
  "dirvotes": false,
  "description": "I'm 22M fresh graduate. I would like to ask how do you make friends once done in school? Many people have been saying na your workmates aren't your friends kaya ekis na siguro don. Unfortunately, I don't really have a friend in college that I can hang out with (gala, party, vacation). I do have some friends nung JHS and SHS but they all have friends na they gala with most of the time since I'm quite far from them. I know streamer QuarterJade have a similar story where she told that she really didn't have friends from college but now she has a lot of friends and support system because of streaming. Now, I am not a streamer and second, my work setup is work from home kaya I feel like it will be a lot harder to make friends then. Before any of you say, na it's okay gumala alone ganyan, I've been doing that okayy like going to concerts alone and such. It's just that I think it will be more fun to go with some people and the activities that I want to try (e.g. laser tag, camping, ek) are more fun with a group of people. Also now that I have already started working na, I will have more money to spare for leisure activities.",
  "comments": [
    {
      "username": "Kanae_2434",
      "date": "2015-12-03T06:06:23-08:00",
      "votes": 12,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "You know what, I see that comment a lot dito na your workmatyes are not your friends but it is the total opposite for me. An dami ko naging friends from work and kahit saan ako mag work nagkaka friends talaga ako and a lot of them kahit 4-5 years na kame di na workmates, I still interact with them on social media and I still care for them. I don';t know why people feel na they cant make friends at work. Im sure they have reasons and I totally understand na iba iba tayo e. But sa mga fresh grad, lage ko talaga advice wag muna mag work from home. Mag onsite muna and meet new people. May makaka vibes ka talaga e as long as you are open."
    },
    {
      "username": "Vamp_Kuzu",
      "date": "2016-04-18T01:41:27-08:00",
      "votes": 10,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Hi! I'm into hiking/camping/backpacking (everything outdoorsy). Solo traveler ako most of the time, pero I have a group of friends that I go camping with. I'm also part of a gc na nabuo nung 2021 from a different FB group, and we're from different parts of the country (yung iba nagmigrate na). Super solid yung friendship na nabuo kahit di kami magkaka-age (teenage-30s). Message mo lang ako if you're interested to join :)"
    }
  ]
},
{
  "_id": {
    "$oid": "64bb8abf64502d2315ff4743"
  },
  "title": "Need migration advice!",
  "username": "Kanae_2434",
  "votes": 15,
  "date": "2018-11-29T03:18:40-08:00",
  "clickvote": false,
  "dirvotes": false,
  "deleted": false,
  "description": "Planning to migrate sa ibang country for work sa australia or canada. Preferably not student visa. Planning to migrate after 1-2 years pa Any tips po for first time and recommendation anong agency po makakahelp? *short background In my mid 20s Single and a licensed architect here. I have full time job that pays for my need Around 20-30k php a month, and may side husstle minsan as a freelance architect. Namemeet naman yung mga needs ko kaso sobrang konti na lang ng natitira for savings. After paying the bills , food transpo etc. I also have maintenance check ups and medicines and nahihiya ako kasi madalas wala akong ma share sa bahay, though pag may extra nagbibigay naman ako. 1-2 years pa beacuse I want to try if makahanap ba ako ng full time job na at least paying 60k+ monthly and if mag work out pa yung pagiging freelance architect ko and have my own projects as well.",
  "comments": [
    {
      "username": "Vamp_Kuzu",
      "date": "2020-01-16T06:28:30-08:00",
      "votes": 12,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Remember, the migration process takes time and effort. Stay focused on your goals, continue building your professional profile, and remain persistent in your pursuit of a better career and life abroad. Good luck with your migration plans!"
    },
    {
      "username": "oO0Eve0Oo",
      "date": "2017-01-19T05:10:59-08:00",
      "votes": 4,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Try mo rin or please consider Netherlands. However, I am not sure about the field of architecture here and if looking ba sila for expats. Check Linkedin and Indeed. Eligible companies can offer you a high skilled migrant visa for 5 years. Then you can apply for permanent residency and citizenship if you like (once you pass their civic integration exam). EU citizen ka na rin. Super chill (of course depends sa company) and they promote work life balance. High cost of living nga lang. I don't know about architecture field kasi nasa IT kami and yun ang madalas na pathway dito ng expats. Fluent din sila mag-English."
    },
    {
      "username": "uni_mafumafu",
      "date": "2014-03-15T07:47:49-08:00",
      "votes": 5,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Nagrresearch pa rin ako for Australia. For skilled migration (work) visas; VISA 190, 189, 491 - Permanent Residency VISA 482 - Temporary (up to 3 years) and tied up with the sponsor company Sa pagkakaalam ko, yung UP Engineering grads may postgrad visa valid for 1 year. Yung applicability ng visas na 'to, magdedepende rin sa profession mo. Check mo yung ANZSCO code ng profession mo and start from there kung ano yung requirements. Iba iba kasi yung assessing authority. And iba iba rin rules per state. Also, it's a point system. Shempre, the higher, the better, bigger chance of being selected sa invitation rounds."
    }
  ]
},
{
  "_id": {
    "$oid": "64bb8ad764502d2315ff4744"
  },
  "title": "Asking Salary (I need your advice)",
  "username": "Vamp_Kuzu",
  "votes": 45,
  "date": "2019-02-18T07:28:03-08:00",
  "clickvote": false,
  "dirvotes": false,
  "deleted": false,
  "description": "I am working as a specialist in one of the known IT companies here in the PH for 5 yrs.  My basic salary is 60k+ but with the monthly allowance and incoming monthly bonus I can earn up to 75k-80k (no tax deduction yet). Since this is my first job, I don’t know how to negotiate for the salary if I will apply to another company. Is 100k good? considering that tax deduction will be higher? I think it is low but also I don’t have the confidence to ask for much higher.  How do you come up for saying what is your asking salary? Thank you",
  "comments": [
    {
      "username": "uni_mafumafu",
      "date": "2019-05-05T02:32:54-08:00",
      "votes": 42,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "context often dictates how you can negotiate. if sila nauna nag reach out (you did not apply), you have leverage. if you offer a niche skill they really need, you have leverage. in your interviews take time to understand their need and market yourself in a way that showcases what value you bring to the table. not uncommon for companies to offer 30% pay raise kung qualified ka. can be negotiated higher if you know the role is quite big and you can prove you are a strong fit. an approach that always worked for me is that if they ask me ano asking salary ko, i answer with a question on what is the range of their budget. there is always a budget range that they can share as the roles are bracketed by job levels. don't fall into the trap of being lowballed if your asking is below the minimum salary of said role. if di nila i-share, give them your asking (i'd say at least 30% raise), but clear out that your asking may change based on the JD and the expectations. what i also do when i give my asking is i give my NET (takehome) expectation and I let them figure out the right mix of base pay + allowances. it helps them play with the system on keeping you within range of the bracket (base salary) but give the offer a bump via allowances. doing interviews like this shows that you are also an assertive person who knows their worth, and any company worth going to will likely see that as a confident/assertive person, and not as being greedy or mayabang. just my (very long) two cents. pm me if you want to talk - we're in the same industry and i've done fairly well in the last 12+ years so i can share tips if you'd like."
    },
    {
      "username": "Kanae_2434",
      "date": "2023-06-23T11:17:14-08:00",
      "votes": 14,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Check market salary with regards to your experience, position/level, and title. You can use that as leverage that the rate you are asking is the market ongoing rate. However, take note also that the standard increase is only about 20% when you move to another company. So you have to balance it out so you wouldn't look too greedy asking for double."
    },
    {
      "username": "soraruru",
      "date": "2016-01-30T05:24:43-08:00",
      "votes": 3,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Congratulations on your 5 years of experience as an IT specialist! That's a great accomplishment, and it's clear that you're a valuable asset to your current company. As for your question about negotiating salary, I think 100k is a good starting point. It's a bit higher than what you're currently making, but it's still within the range of what other IT specialists in the Philippines are making. And with your experience, you should be able to justify your asking price. Of course, the exact amount you can negotiate for will depend on a number of factors, including the company you're applying to, the specific role you're applying for, and the overall market conditions. But 100k is a good starting point, and you can always negotiate up from there."
    }
  ]
},
{
  "_id": {
    "$oid": "64bb8afd64502d2315ff4745"
  },
  "title": "Credit Card Application Denied",
  "username": "oO0Eve0Oo",
  "votes": 15,
  "date": "2016-12-11T09:31:36-08:00",
  "clickvote": false,
  "dirvotes": false,
  "deleted": false,
  "description": "Need advice kasi I don’t understand why di ako naapprove sa credit card applications ko. I’ve never had a credit card pa pero I thought of getting one na for emergency purposes. I’m earning 850k pesos per year and have a car loan sa SecBank. I applied kay SecBank but got denied and they didn't  tell me the reason why. I applied sa BDO, BPI, EastWest, UB, and PNB and got denied with all of them. Am I missing something? I have no other loans or debts naman.",
  "comments": [
    {
      "username": "Kanae_2434",
      "date": "2021-04-02T10:41:14-08:00",
      "votes": 73,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Do you have an ITR? But you still have chance kahit wala pa yan. Speaking from experience. Try opening a savings account in RCBC, maglagay ka 100k and maintain it for atleast 3 months, pa tag mo as hexagon member."
    },
    {
      "username": "soraruru",
      "date": "2018-03-05T02:04:54-08:00",
      "votes": 17,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "If your company is considered under call center/bpo industry, dinideny talaga nila mostly. Well, not all, pero again, mostly. Madami daw kasing bad records mga employees sa industry kadamihan pagdating sa credit cards."
    },
    {
      "username": "uni_mafumafu",
      "date": "2021-06-18T10:56:33-08:00",
      "votes": 24,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "try getting secured credit card first, sure yan. Eventually pwede mo na request na unsecured after, just ask the teller ano yung qualifications to do so."
    }
  ]
},
{
  "_id": {
    "$oid": "64bb8b0b64502d2315ff4746"
  },
  "title": "How to really save?",
  "username": "uni_mafumafu",
  "votes": 29,
  "date": "2014-08-24T10:24:04-08:00",
  "clickvote": false,
  "dirvotes": false,
  "deleted": false,
  "description": "Hi! I'm going to be eighteen y.o. this year. I'm grateful that I'm earning money from my business which I never expected to become as my source of allowance or anything to pay for whatever things I like. I'm really really grateful having this source of income. I'm still dependent sa parents ko po and still a student as well. I do nothing, as in nothing and I just earn money and because of that I never asked na sa mom ko to buy things I need or want. Well, there's slightly tasks naman but it's not much work and I'm earning a lot from those little tasks sometimes to zero effort. I made use of something that my mom gave to me and never expected to earn a lot from it. Since I'm earning money without doing much, I want to save for things in the future. I know this is a really basic question, but if you have your own answers on how to save, that will surely help me + tips or methods. Thank you.",
  "comments": [
    {
      "username": "soraruru",
      "date": "2019-10-08T04:10:42-08:00",
      "votes": 24,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "That's wonderful to hear that you have found a source of income through your business at such a young age. It's commendable that you want to start saving for the future and be financially responsible. Saving is a habit that requires discipline and consistency. By starting early and being mindful of your spending, you're already taking steps in the right direction. Good luck with your savings journey, and congratulations again on your business success!"
    },
    {
      "username": "Kanae_2434",
      "date": "2019-09-04T02:59:55-08:00",
      "votes": 15,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Build your EF, protect your base. Invest mo ung iba. That will give you profit overtime"
    }
  ]
},
{
  "_id": {
    "$oid": "64bbaf9064502d2315ff475b"
  },
  "title": "From 300k to 80k in the bank realquick",
  "username": "Kanae_2434",
  "votes": 12,
  "date": "2018-11-29T03:18:40-08:00",
  "clickvote": false,
  "dirvotes": false,
  "deleted": false,
  "description": "Na ospital po mama ko, sinagot ko lahat ng gastos, mula check up, tests, and maintenance po, hindi lang yan, bumili din ako laptop at phone para sa work ko at need ko talaga hindi want lang. Nararamdaman kong imbis na makaipon ako, pabawas na pera ko these past months. Bills, pagkain, gamot tapos may gf pa kong pinapaaral. Wala nang income parents ko at sakin nalang umaasa. Lahat sakin umaasa pero monthly income ko lang 50k tapos may isang business na hindi ganun kalaki income. Then suddenly bigla akong nawalan ng gana, hindi ako pumasok ngayong araw. Napaisip ako na habambuhay ba na aasa sakin tong mga to? Nag salita ako one time, tapos sinabi pa nila na sinusumbat ko lahat ng ginawa ko para sa kanila, gusto ko lang naman na tulungan nila ako hindi yung ganitong mamamatay na ko sa puyat at stress sa trabaho, business at personal life ko. Parang ako pa may mali? Nakakasawa na kasi talaga yung ganito, hanggang kailan ako mag pprovide sa kanila tapos kapag may sinabi ako sasabihin nila sinusumbatan ko sila. Na diagnosed na ko ng depression nung college days ko, mukhang eto na naman ako, may s**** thoughts na naman ako. Gusto ko lang mag vent at hingi na din ako ng advice kung ano sasabihin ko sa kanila. Ngayon gusto ko i cut relationship ko sa lahat ng taong binubuhay ko. Gusto ko naman magawa yung mga bagay na gusto ko.",
  "comments": [
    {
      "username": "Vamp_Kuzu",
      "date": "2020-01-16T06:28:30-08:00",
      "votes": 120,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Rule of thumb: they will find ways to survive even if you are dead, OP. Kaya live for yourself, di ka nabuhay para maging ATM. GF mo sabihan mo mag working student at yun magulang mo na ito lang set budget yun ipapadala mo. Tiisin mo sila."
    },
    {
      "username": "oO0Eve0Oo",
      "date": "2017-01-19T05:10:59-08:00",
      "votes": 4,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Bakit ikaw nagpapaaral sa gf mo? Wala ba sya magulang?"
    },
    {
      "username": "uni_mafumafu",
      "date": "2014-03-15T07:47:49-08:00",
      "votes": 5,
      "clickvote": false,
      "dirvotes": false,
      "deleted": false,
      "description": "Practice setting boundaries OP. It will hurt but they need tough love or else the cycle will just continue. Praying for you!"
    }
  ]
}]